{
    "iOS": [
        {
            "topic": "General",
            "questions": [
                "Was candidate late for the interview? Any valid reason was given?",
                "How do you update your self?",
                "Do you write any technical blog?",
                "What are the blogs do you regularly read?",
                "What did you learn recently? Could summaries in a few sentences?",
                "What are the common iOS development mistakes happen?",
                "Do you follow WWDC changes?",
                "What did you like in current WWDC from new APIs point of view?",
                "Any changes you want to see in any framework in next WWDC?"
            ]
        },
        {
            "topic": "Xcode, Instruments",
            "questions": [
                "What is a TestPlan in Xcode?",
                "Which Xcode version are you using in your day to day work?",
                "Any particular new feature do you like?",
                "What are the launch arguments in Xcode?",
                "What are the difference between Version number and Build number?",
                "What are the environment variables in Xcode?",
                "How do we use environment variables and which API provides it?",
                "Can we use environment variables in tests?",
                "What are the Predefined Environment Variables?",
                "Have you worked with NSZombieEnabled, NSDeallocateZombies, MallocGuardEdges?",
                "How would you run an iOS app in other languages without changing the iPhone language or making any dummy code changes?",
                "What is a Thread Sanitizer?",
                "What is SwiftLint and how could we use it?",
                "Have you heard about SwiftFormatter?",
                "What is a `.p12` file?",
                "Where do we include iPhone device id to run the app on a device?",
                "What is `info.plist` file and what type of objects a property list supports?",
                "How often do you use Instruments?",
                "What is an entitlement file? When and why do we use it?"
            ]
        },
        {
            "topic": "Dependency Manager",
            "questions": [
                "What is the difference between a Podfile and a podspec file?",
                "In which language podfile is written?",
                "What is the basic difference between Cocoapods and Carthage?",
                "Have you worked with Swift Package Manager?",
                "How do we add resources in Swift Package Manager?",
                "What is Cocoapod registry?",
                "What is a Gemfile?"
            ]
        },
        {
            "topic": "Version Control",
            "questions": [
                "What allows you to combine your commits? What does rebase do?",
                "Which does git stash do?",
                "What is a Trunk Based development?",
                "What is the difference between rebasing and merging in git?",
                "What is a Monorepo?",
                "What is a Submodule?",
                "What is an Artifactory?"
            ]
        },
        {
            "topic": "Design Pattern, Principles",
            "questions": [
                "What are the pros and cons of using Singleton?",
                "What is your preferred way of using Singleton in the app? And writing test around it?",
                "What is big-O notation?",
                "What are the SOLID principles?",
                "What is Redux framework?",
                "What benefits does MVVM provide over MVC?"
            ]
        },
        {
            "topic": "Swift",
            "questions": [
                "What is the current version of Swift?",
                "Do you follow Swift proposals?",
                "What was the recent change you liked in Swift and why?",
                "Collection, Properties, Methods",
                "What is property wrapper, how to create a custom property wrappers?",
                "Can we have any type of key in Dictionary?",
                "Can lazy property cause a memory leak if self is used while computing lazy property?",
                "What is the difference between an Static vs a Class property?",
                "Are static let properties lazy by definition?",
                "When `@objc` and `@nonobjc` write before method and variable in swift?",
                "What is the difference between map, compactMap, and flatMap functions?",
                "What is the difference between filter and reduce functions?",
                "What are a functor and monad?",
                "What is a guard statement?",
                "What is a defer statement?",
                "Can we have break/return/throw or any error inside defer statement?",
                "Can we've multiple defer in one function? What is the order of execution FILO?"
            ]
        },
        {
            "topic": "Threads and Memory",
            "questions": [
                "What is Stack and Heap memory allocation?",
                "What are the access levels of Swift?",
                "Which access level is the default?",
                "What is the difference between open vs public?",
                "What is the difference between public vs internal/private vs internal?",
                "What is the use of `fileprivate` in swift?",
                "What is Copy On Write?",
                "How ARC is implemented in Swift?",
                "What is the difference between `[weak self]` and `[unowned self]`?",
                "How do you create Singleton in Swift?",
                "Is static let a Thread Safe property?",
                "How do we create Singleton in Objective-C?",
                "Is DispatchOnce thread-safe?",
                "Is DispatchOnce synchronous or asynchronous?"
            ]
        },
        {
            "topic": "Protocol, Class, Struct, Enum",
            "questions": [
                "What is Hashable?",
                "What is Synthesized Equatable and Hashable?",
                "What is Conditional conformance?",
                "What is TypeEraser in Swift?",
                "What are AnySequence and use-case?",
                "What is a Protocol composition?",
                "What happens (behind the scene) when you create a protocol composition?",
                "How do we define a set only property in the protocol?",
                "How do we define a class property in a protocol?",
                "Is it possible to have a Generic protocol?",
                "What is an Associated Type in Protocol?",
                "Could you explain Associatedtype?",
                "What is an encapsulation?",
                "What is the difference between == vs === operator?",
                "Can an associated type have a default value?",
                "What is the difference Any and AnyObject?",
                "What is a Subscript?",
                "What is the swift implementation of ImplicitlyUnwrappedOptionals and an Optional?",
                "Is there any inheritance between ImplicitlyUnwrappedOptionals and an Optional?",
                "`struct Zoo { var zoo: Zoo }` Can a struct contain instance of itself?",
                "What are the types of initializers? init? / failable init, Convenience initializer vs designated initializers?",
                "What is the different between `is` and `as`? for ex: FooType is/as SomeType",
                "What are SequenceType, GeneratorType and CollectionType?",
                "What is Opaque return type in swift?",
                "What is frozen enum?"
            ]
        },
        {
            "topic": "Foundation",
            "questions": [
                "How would you parse custom date formatter with Codable?",
                "What is `dateDecodingStrategy`?",
                "How would you encode/decode an Enum with associated types?",
                "How would you handle empty response parsing?",
                "How would you handle two API responses in a single model?",
                "What is the difference NSOperation vs GCD?",
                "What is DispatchGroup?",
                "What is the difference between Concurrency vs Parallelism?",
                "What is the difference Multitasking vs MultiThreading?",
                "What does Dispatch Barrier do?",
                "What are the ways to make code thread-safe?",
                "What does @synchronized keyword do?",
                "What does @synthesized keyword do?",
                "What is URLCache?",
                "What is URLComponents?",
                "What is the difference between Stack and Heap?",
                "What is the difference between a Thread, a Process, and a Task?"
            ]
        },
        {
            "topic": "UIKit",
            "questions": [
                "Can you write hitTest for a window or a view?",
                "What is the UIWindow hierarchy?",
                "What is anchor points of a view?",
                "What is a view’s offset, what value does it hold?",
                "What is an update cycle of a UIView?",
                "run loop runs every 16 milliseconds, it gives 60 frame per seconds, which runs the update cycle?",
                "What is the best place in UIViewController instance to set up custom views and layouts?",
                "What is `loadView()`?",
                "What is the view controller life cycle?",
                "How does load view affect view controller lifecycle",
                "How would you implement cell reusability?",
                "Hierarchy of UIView/UIButton classes?",
                "What is the superclass of a UIWindow?",
                "Why IBOutlets are weak?",
                "What will happen if we make IBOutlets strong? Would there any retain cycle?",
                "What is the intrinsic content size?",
                "What are the UI elements supports intrinsic content size feature?",
                "What are contentHuggingPriority and contentCompressionResistancePriority?",
                "What are the layout anchors?",
                "What is the difference between `setNeedsLayout v layout if needed`?",
                "What is the difference between setNeedsLayout vs setNeedsDisplay?",
                "What is a UILayoutGuide?",
                "Are layout guide part of responder chain?",
                "Can you tell me about the hierarchy does layout guide response to events or UIResponse?"
            ]
        },
        {
            "topic": "Reactive Programming",
            "questions": [
                "What are Subjects?",
                "What is the difference between flatMap and flatMapLatest?",
                "What is switchLatest?",
                "What are RxSwift traits",
                "What is RxCocoa Traits?",
                "What is Subscription in Combine?",
                "How to create customer Subscriber or Publisher in Combine?"
            ]
        },
        {
            "topic": "Testing",
            "questions": [
                "What is a TestPlan in Xcode?",
                "What are Quick and Nimble frameworks?",
                "Would you prefer using Quick/Nimble over XCTest? or why?",
                "How would you test universal links in the app?",
                "How would you test deep-linking to the app?",
                "What are the types of testing methods you have used?",
                "What is Black box testing?",
                "What is Feature testing?",
                "What is the Smoke test?",
                "What is the Staging test?",
                "What is the Release test?",
                "What is Automation suit?",
                "What is Regression test?",
                "What is the difference between BDT vs TDD?",
                "How does BDT work in iOS apps?",
                "Do you know anything about the APM (Application Monitoring) tool?",
                "How does integration testing work?",
                "What feature does TestFlight provides?",
                "What are the difference between Fastlane and a CI tool?",
                "Can we use Bitrise and Fastlane together?",
                "What is CI and CD? Which tools have you worked with Bitrise, Travis CI, Circle CI, Jenkins, GitHub Actions, etc.",
                "How would you test an app if the backend is not responding?",
                "What are test doubles, what is the difference between Dummy and Mock?",
                "How would you replicate bad behavior from a backend?"
            ]
        },
        {
            "topic": "Server Side Swift",
            "questions": [
                "What is bearer authentication?",
                "What is JWT authentication?",
                "Difference Fluent ORM: MySQL, PostgreSQL, and SQLite"
            ]
        },
        {
            "topic": "Kotlin Multiplatform",
            "questions": [
                "What is gradle?",
                "Do you anything about Kotlin Multi-Platform?",
                "What is Maven?"
            ]
        }
    ]
}